package com.marks.leetcode.daily_question;

import org.junit.jupiter.api.Test;

import static org.junit.jupiter.api.Assertions.*;

/**
 * <p>项目名称: LeetCode_QA </p>
 * <p>文件名称: LeetCode_3453Test </p>
 * <p>描述: [类型描述] </p>
 *
 * @author marks
 * @version v1.0
 * @date 2026/1/13 16:13
 * @update [序号][日期YYYY-MM-DD] [更改人姓名][变更描述]
 */
class LeetCode_3453Test {

    @Test
    void separateSquares() {
        // [[522261215,954313664,225462],[628661372,718610752,10667],[619734768,941310679,44788],[352367502,656774918,289036],[860247066,905800565,100123],[817623994,962847576,71460],[691552058,782740602,36271],[911356,152015365,513881],[462847044,859151855,233567],[672324240,954509294,685569]]
        int[][] squares = new int[][]{
                {522261215,954313664,225462},
                {628661372,718610752,10667},
                {619734768,941310679,44788},
                {352367502,656774918,289036},
                {860247066,905800565,100123},
                {817623994,962847576,71460},
                {691552058,782740602,36271},
                {911356,152015365,513881},
                {462847044,859151855,233567},
                {672324240,954509294,685569}
        };
        LeetCode_3453 leetCode_3453 = new LeetCode_3453();
        double result = leetCode_3453.separateSquares(squares);
        System.out.println(result);
    }
}